
---- EXPECTED OUTPUT
[Successful compilation of %s]
prompt> [User Function foo (8 ops)]
L14-16 foo() %s - %s + 8 ops
 L14   #0     RECV                    1                                         $baz                
 L15   #1     INIT_FCALL%s %d %s "var_dump"                               
 L15   #2     INIT_FCALL%s %d %s "strrev"                                 
 L15   #3     SEND_VAR                $baz                 1                                        
 L15   #4     DO_%cCALL                                                          @0                  
 L15   #5     SEND_VAR                @0                   1                                        
 L15   #6     DO_%cCALL                                                                              
 L16   #7     RETURN                  null                                                          
prompt> [User Class: Foo\Bar (2 methods)]
L5-7 Foo\Bar::Foo() %s - %s + 5 ops
 L5    #0     RECV                    1                                         $bar                
 L6    #1     INIT_NS_FCALL_BY_NAME                        "Foo\\var_dump"                          
 L6    #2     SEND_VAR_EX             $bar                 1                                        
 L6    #3     DO_FCALL                                                                              
 L7    #4     RETURN                  null                                                          
L9-9 Foo\Bar::baz() %s - %s + 1 ops
 L9    #0     RETURN                  null                                                          
prompt> [Not Executing!]
prompt> [Context %s (11 ops)]
L1-21 {main}() %s - %s + 11 ops
 L4    #0     NOP                                                                                   
 L14   #1     NOP                                                                                   
 L18   #2     NEW                     "Foo\\Bar"                                @1                  
 L18   #3     DO_FCALL                                                                              
 L18   #4     INIT_METHOD_CALL        @1                   "Foo"                                    
 L18   #5     SEND_VAL_EX             "test"               1                                        
 L18   #6     DO_FCALL                                                                              
 L19   #7     INIT_FCALL%s %d %s "foo"                                    
 L19   #8     SEND_VAL                "test"               1                                        
 L19   #9     DO_FCALL                                                                              
 L21   #10    RETURN                  1                                                             
prompt>
---- ACTUAL OUTPUT
[Successful compilation of /root/php-src/sapi/phpdbg/tests/print_001.php]
prompt> [User Function foo (15 ops)]
L14-16 foo() /root/php-src/sapi/phpdbg/tests/print_001.php - 0x7f3bd7684000 + 15 ops
 L14   #0     EXT_NOP                                                                               
 L14   #1     RECV                    1                                         $baz                
 L15   #2     EXT_STMT                                                                              
 L15   #3     INIT_FCALL              96                   "var_dump"                               
 L15   #4     EXT_FCALL_BEGIN                                                                       
 L15   #5     INIT_FCALL              96                   "strrev"                                 
 L15   #6     EXT_FCALL_BEGIN                                                                       
 L15   #7     SEND_VAR                $baz                 1                                        
 L15   #8     DO_FCALL                                                          @0                  
 L15   #9     EXT_FCALL_END                                                                         
 L15   #10    SEND_VAR                @0                   1                                        
 L15   #11    DO_FCALL                                                                              
 L15   #12    EXT_FCALL_END                                                                         
 L16   #13    EXT_STMT                                                                              
 L16   #14    RETURN                  null                                                          
prompt> [User Class: Foo\Bar (2 methods)]
L5-7 Foo\Bar::Foo() /root/php-src/sapi/phpdbg/tests/print_001.php - 0x7f3bd7681000 + 10 ops
 L5    #0     EXT_NOP                                                                               
 L5    #1     RECV                    1                                         $bar                
 L6    #2     EXT_STMT                                                                              
 L6    #3     INIT_NS_FCALL_BY_NAME                        "Foo\\var_dump"                          
 L6    #4     EXT_FCALL_BEGIN                                                                       
 L6    #5     SEND_VAR_EX             $bar                 1                                        
 L6    #6     DO_FCALL                                                                              
 L6    #7     EXT_FCALL_END                                                                         
 L7    #8     EXT_STMT                                                                              
 L7    #9     RETURN                  null                                                          
L9-9 Foo\Bar::baz() /root/php-src/sapi/phpdbg/tests/print_001.php - 0x7f3bd7680080 + 3 ops
 L9    #0     EXT_NOP                                                                               
 L9    #1     EXT_STMT                                                                              
 L9    #2     RETURN                  null                                                          
prompt> [Not Executing!]
prompt> [Context /root/php-src/sapi/phpdbg/tests/print_001.php (23 ops)]
L1-21 {main}() /root/php-src/sapi/phpdbg/tests/print_001.php - 0x7f3bd7685000 + 23 ops
 L3    #0     NOP                                                                                   
 L4    #1     EXT_STMT                                                                              
 L4    #2     NOP                                                                                   
 L13   #3     NOP                                                                                   
 L14   #4     EXT_STMT                                                                              
 L14   #5     NOP                                                                                   
 L18   #6     EXT_STMT                                                                              
 L18   #7     NEW                     "Foo\\Bar"                                @1                  
 L18   #8     EXT_FCALL_BEGIN                                                                       
 L18   #9     DO_FCALL                                                                              
 L18   #10    EXT_FCALL_END                                                                         
 L18   #11    INIT_METHOD_CALL        @1                   "Foo"                                    
 L18   #12    EXT_FCALL_BEGIN                                                                       
 L18   #13    SEND_VAL_EX             "test"               1                                        
 L18   #14    DO_FCALL                                                                              
 L18   #15    EXT_FCALL_END                                                                         
 L19   #16    EXT_STMT                                                                              
 L19   #17    INIT_FCALL              128                  "foo"                                    
 L19   #18    EXT_FCALL_BEGIN                                                                       
 L19   #19    SEND_VAL                "test"               1                                        
 L19   #20    DO_FCALL                                                                              
 L19   #21    EXT_FCALL_END                                                                         
 L21   #22    RETURN                  1                                                             
prompt>
---- FAILED
